grevaillot/svd_tools/headers/ATSAMV71Q19B/piod.h
/** @defgroup piod_pio_pdr PIOPDR PIO Disable Register
@{*/

/** PIOD_PIO_PDR_P31 PIO Disable **/
#define PIOD_PIO_PDR_P31		(1 << 31)
/** PIOD_PIO_PDR_P30 PIO Disable **/
#define PIOD_PIO_PDR_P30		(1 << 30)
/** PIOD_PIO_PDR_P29 PIO Disable **/
#define PIOD_PIO_PDR_P29		(1 << 29)
/** PIOD_PIO_PDR_P28 PIO Disable **/
#define PIOD_PIO_PDR_P28		(1 << 28)
/** PIOD_PIO_PDR_P27 PIO Disable **/
#define PIOD_PIO_PDR_P27		(1 << 27)
/** PIOD_PIO_PDR_P26 PIO Disable **/
#define PIOD_PIO_PDR_P26		(1 << 26)
/** PIOD_PIO_PDR_P25 PIO Disable **/
#define PIOD_PIO_PDR_P25		(1 << 25)
/** PIOD_PIO_PDR_P24 PIO Disable **/
#define PIOD_PIO_PDR_P24		(1 << 24)
/** PIOD_PIO_PDR_P23 PIO Disable **/
#define PIOD_PIO_PDR_P23		(1 << 23)
/** PIOD_PIO_PDR_P22 PIO Disable **/
#define PIOD_PIO_PDR_P22		(1 << 22)
/** PIOD_PIO_PDR_P21 PIO Disable **/
#define PIOD_PIO_PDR_P21		(1 << 21)
/** PIOD_PIO_PDR_P20 PIO Disable **/
#define PIOD_PIO_PDR_P20		(1 << 20)
/** PIOD_PIO_PDR_P19 PIO Disable **/
#define PIOD_PIO_PDR_P19		(1 << 19)
/** PIOD_PIO_PDR_P18 PIO Disable **/
#define PIOD_PIO_PDR_P18		(1 << 18)
/** PIOD_PIO_PDR_P17 PIO Disable **/
#define PIOD_PIO_PDR_P17		(1 << 17)
/** PIOD_PIO_PDR_P16 PIO Disable **/
#define PIOD_PIO_PDR_P16		(1 << 16)
/** PIOD_PIO_PDR_P15 PIO Disable **/
#define PIOD_PIO_PDR_P15		(1 << 15)
/** PIOD_PIO_PDR_P14 PIO Disable **/
#define PIOD_PIO_PDR_P14		(1 << 14)
/** PIOD_PIO_PDR_P13 PIO Disable **/
#define PIOD_PIO_PDR_P13		(1 << 13)
/** PIOD_PIO_PDR_P12 PIO Disable **/
#define PIOD_PIO_PDR_P12		(1 << 12)
/** PIOD_PIO_PDR_P11 PIO Disable **/
#define PIOD_PIO_PDR_P11		(1 << 11)
/** PIOD_PIO_PDR_P10 PIO Disable **/
#define PIOD_PIO_PDR_P10		(1 << 10)
/** PIOD_PIO_PDR_P9 PIO Disable **/
#define PIOD_PIO_PDR_P9		(1 << 9)
/** PIOD_PIO_PDR_P8 PIO Disable **/
#define PIOD_PIO_PDR_P8		(1 << 8)
/** PIOD_PIO_PDR_P7 PIO Disable **/
#define PIOD_PIO_PDR_P7		(1 << 7)
/** PIOD_PIO_PDR_P6 PIO Disable **/
#define PIOD_PIO_PDR_P6		(1 << 6)
/** PIOD_PIO_PDR_P5 PIO Disable **/
#define PIOD_PIO_PDR_P5		(1 << 5)
/** PIOD_PIO_PDR_P4 PIO Disable **/
#define PIOD_PIO_PDR_P4		(1 << 4)
/** PIOD_PIO_PDR_P3 PIO Disable **/
#define PIOD_PIO_PDR_P3		(1 << 3)
/** PIOD_PIO_PDR_P2 PIO Disable **/
#define PIOD_PIO_PDR_P2		(1 << 2)
/** PIOD_PIO_PDR_P1 PIO Disable **/
#define PIOD_PIO_PDR_P1		(1 << 1)
/** PIOD_PIO_PDR_P0 PIO Disable **/
#define PIOD_PIO_PDR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pio_psr PIOPSR PIO Status Register
@{*/

/** PIOD_PIO_PSR_P31 PIO Status **/
#define PIOD_PIO_PSR_P31		(1 << 31)
/** PIOD_PIO_PSR_P30 PIO Status **/
#define PIOD_PIO_PSR_P30		(1 << 30)
/** PIOD_PIO_PSR_P29 PIO Status **/
#define PIOD_PIO_PSR_P29		(1 << 29)
/** PIOD_PIO_PSR_P28 PIO Status **/
#define PIOD_PIO_PSR_P28		(1 << 28)
/** PIOD_PIO_PSR_P27 PIO Status **/
#define PIOD_PIO_PSR_P27		(1 << 27)
/** PIOD_PIO_PSR_P26 PIO Status **/
#define PIOD_PIO_PSR_P26		(1 << 26)
/** PIOD_PIO_PSR_P25 PIO Status **/
#define PIOD_PIO_PSR_P25		(1 << 25)
/** PIOD_PIO_PSR_P24 PIO Status **/
#define PIOD_PIO_PSR_P24		(1 << 24)
/** PIOD_PIO_PSR_P23 PIO Status **/
#define PIOD_PIO_PSR_P23		(1 << 23)
/** PIOD_PIO_PSR_P22 PIO Status **/
#define PIOD_PIO_PSR_P22		(1 << 22)
/** PIOD_PIO_PSR_P21 PIO Status **/
#define PIOD_PIO_PSR_P21		(1 << 21)
/** PIOD_PIO_PSR_P20 PIO Status **/
#define PIOD_PIO_PSR_P20		(1 << 20)
/** PIOD_PIO_PSR_P19 PIO Status **/
#define PIOD_PIO_PSR_P19		(1 << 19)
/** PIOD_PIO_PSR_P18 PIO Status **/
#define PIOD_PIO_PSR_P18		(1 << 18)
/** PIOD_PIO_PSR_P17 PIO Status **/
#define PIOD_PIO_PSR_P17		(1 << 17)
/** PIOD_PIO_PSR_P16 PIO Status **/
#define PIOD_PIO_PSR_P16		(1 << 16)
/** PIOD_PIO_PSR_P15 PIO Status **/
#define PIOD_PIO_PSR_P15		(1 << 15)
/** PIOD_PIO_PSR_P14 PIO Status **/
#define PIOD_PIO_PSR_P14		(1 << 14)
/** PIOD_PIO_PSR_P13 PIO Status **/
#define PIOD_PIO_PSR_P13		(1 << 13)
/** PIOD_PIO_PSR_P12 PIO Status **/
#define PIOD_PIO_PSR_P12		(1 << 12)
/** PIOD_PIO_PSR_P11 PIO Status **/
#define PIOD_PIO_PSR_P11		(1 << 11)
/** PIOD_PIO_PSR_P10 PIO Status **/
#define PIOD_PIO_PSR_P10		(1 << 10)
/** PIOD_PIO_PSR_P9 PIO Status **/
#define PIOD_PIO_PSR_P9		(1 << 9)
/** PIOD_PIO_PSR_P8 PIO Status **/
#define PIOD_PIO_PSR_P8		(1 << 8)
/** PIOD_PIO_PSR_P7 PIO Status **/
#define PIOD_PIO_PSR_P7		(1 << 7)
/** PIOD_PIO_PSR_P6 PIO Status **/
#define PIOD_PIO_PSR_P6		(1 << 6)
/** PIOD_PIO_PSR_P5 PIO Status **/
#define PIOD_PIO_PSR_P5		(1 << 5)
/** PIOD_PIO_PSR_P4 PIO Status **/
#define PIOD_PIO_PSR_P4		(1 << 4)
/** PIOD_PIO_PSR_P3 PIO Status **/
#define PIOD_PIO_PSR_P3		(1 << 3)
/** PIOD_PIO_PSR_P2 PIO Status **/
#define PIOD_PIO_PSR_P2		(1 << 2)
/** PIOD_PIO_PSR_P1 PIO Status **/
#define PIOD_PIO_PSR_P1		(1 << 1)
/** PIOD_PIO_PSR_P0 PIO Status **/
#define PIOD_PIO_PSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pio_oer PIOOER Output Enable Register
@{*/

/** PIOD_PIO_OER_P31 Output Enable **/
#define PIOD_PIO_OER_P31		(1 << 31)
/** PIOD_PIO_OER_P30 Output Enable **/
#define PIOD_PIO_OER_P30		(1 << 30)
/** PIOD_PIO_OER_P29 Output Enable **/
#define PIOD_PIO_OER_P29		(1 << 29)
/** PIOD_PIO_OER_P28 Output Enable **/
#define PIOD_PIO_OER_P28		(1 << 28)
/** PIOD_PIO_OER_P27 Output Enable **/
#define PIOD_PIO_OER_P27		(1 << 27)
/** PIOD_PIO_OER_P26 Output Enable **/
#define PIOD_PIO_OER_P26		(1 << 26)
/** PIOD_PIO_OER_P25 Output Enable **/
#define PIOD_PIO_OER_P25		(1 << 25)
/** PIOD_PIO_OER_P24 Output Enable **/
#define PIOD_PIO_OER_P24		(1 << 24)
/** PIOD_PIO_OER_P23 Output Enable **/
#define PIOD_PIO_OER_P23		(1 << 23)
/** PIOD_PIO_OER_P22 Output Enable **/
#define PIOD_PIO_OER_P22		(1 << 22)
/** PIOD_PIO_OER_P21 Output Enable **/
#define PIOD_PIO_OER_P21		(1 << 21)
/** PIOD_PIO_OER_P20 Output Enable **/
#define PIOD_PIO_OER_P20		(1 << 20)
/** PIOD_PIO_OER_P19 Output Enable **/
#define PIOD_PIO_OER_P19		(1 << 19)
/** PIOD_PIO_OER_P18 Output Enable **/
#define PIOD_PIO_OER_P18		(1 << 18)
/** PIOD_PIO_OER_P17 Output Enable **/
#define PIOD_PIO_OER_P17		(1 << 17)
/** PIOD_PIO_OER_P16 Output Enable **/
#define PIOD_PIO_OER_P16		(1 << 16)
/** PIOD_PIO_OER_P15 Output Enable **/
#define PIOD_PIO_OER_P15		(1 << 15)
/** PIOD_PIO_OER_P14 Output Enable **/
#define PIOD_PIO_OER_P14		(1 << 14)
/** PIOD_PIO_OER_P13 Output Enable **/
#define PIOD_PIO_OER_P13		(1 << 13)
/** PIOD_PIO_OER_P12 Output Enable **/
#define PIOD_PIO_OER_P12		(1 << 12)
/** PIOD_PIO_OER_P11 Output Enable **/
#define PIOD_PIO_OER_P11		(1 << 11)
/** PIOD_PIO_OER_P10 Output Enable **/
#define PIOD_PIO_OER_P10		(1 << 10)
/** PIOD_PIO_OER_P9 Output Enable **/
#define PIOD_PIO_OER_P9		(1 << 9)
/** PIOD_PIO_OER_P8 Output Enable **/
#define PIOD_PIO_OER_P8		(1 << 8)
/** PIOD_PIO_OER_P7 Output Enable **/
#define PIOD_PIO_OER_P7		(1 << 7)
/** PIOD_PIO_OER_P6 Output Enable **/
#define PIOD_PIO_OER_P6		(1 << 6)
/** PIOD_PIO_OER_P5 Output Enable **/
#define PIOD_PIO_OER_P5		(1 << 5)
/** PIOD_PIO_OER_P4 Output Enable **/
#define PIOD_PIO_OER_P4		(1 << 4)
/** PIOD_PIO_OER_P3 Output Enable **/
#define PIOD_PIO_OER_P3		(1 << 3)
/** PIOD_PIO_OER_P2 Output Enable **/
#define PIOD_PIO_OER_P2		(1 << 2)
/** PIOD_PIO_OER_P1 Output Enable **/
#define PIOD_PIO_OER_P1		(1 << 1)
/** PIOD_PIO_OER_P0 Output Enable **/
#define PIOD_PIO_OER_P0		(1 << 0)

/**@}*/

