grevaillot/svd_tools/headers/ATSAMV71Q19B/piod.h
/** @defgroup piod_pio_ifscer PIOIFSCER Input Filter Slow Clock Enable Register
@{*/

/** PIOD_PIO_IFSCER_P31 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P31		(1 << 31)
/** PIOD_PIO_IFSCER_P30 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P30		(1 << 30)
/** PIOD_PIO_IFSCER_P29 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P29		(1 << 29)
/** PIOD_PIO_IFSCER_P28 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P28		(1 << 28)
/** PIOD_PIO_IFSCER_P27 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P27		(1 << 27)
/** PIOD_PIO_IFSCER_P26 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P26		(1 << 26)
/** PIOD_PIO_IFSCER_P25 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P25		(1 << 25)
/** PIOD_PIO_IFSCER_P24 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P24		(1 << 24)
/** PIOD_PIO_IFSCER_P23 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P23		(1 << 23)
/** PIOD_PIO_IFSCER_P22 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P22		(1 << 22)
/** PIOD_PIO_IFSCER_P21 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P21		(1 << 21)
/** PIOD_PIO_IFSCER_P20 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P20		(1 << 20)
/** PIOD_PIO_IFSCER_P19 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P19		(1 << 19)
/** PIOD_PIO_IFSCER_P18 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P18		(1 << 18)
/** PIOD_PIO_IFSCER_P17 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P17		(1 << 17)
/** PIOD_PIO_IFSCER_P16 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P16		(1 << 16)
/** PIOD_PIO_IFSCER_P15 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P15		(1 << 15)
/** PIOD_PIO_IFSCER_P14 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P14		(1 << 14)
/** PIOD_PIO_IFSCER_P13 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P13		(1 << 13)
/** PIOD_PIO_IFSCER_P12 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P12		(1 << 12)
/** PIOD_PIO_IFSCER_P11 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P11		(1 << 11)
/** PIOD_PIO_IFSCER_P10 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P10		(1 << 10)
/** PIOD_PIO_IFSCER_P9 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P9		(1 << 9)
/** PIOD_PIO_IFSCER_P8 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P8		(1 << 8)
/** PIOD_PIO_IFSCER_P7 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P7		(1 << 7)
/** PIOD_PIO_IFSCER_P6 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P6		(1 << 6)
/** PIOD_PIO_IFSCER_P5 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P5		(1 << 5)
/** PIOD_PIO_IFSCER_P4 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P4		(1 << 4)
/** PIOD_PIO_IFSCER_P3 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P3		(1 << 3)
/** PIOD_PIO_IFSCER_P2 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P2		(1 << 2)
/** PIOD_PIO_IFSCER_P1 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P1		(1 << 1)
/** PIOD_PIO_IFSCER_P0 Slow Clock Debouncing Filtering Select **/
#define PIOD_PIO_IFSCER_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pio_ifscsr PIOIFSCSR Input Filter Slow Clock Status Register
@{*/

/** PIOD_PIO_IFSCSR_P31 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P31		(1 << 31)
/** PIOD_PIO_IFSCSR_P30 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P30		(1 << 30)
/** PIOD_PIO_IFSCSR_P29 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P29		(1 << 29)
/** PIOD_PIO_IFSCSR_P28 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P28		(1 << 28)
/** PIOD_PIO_IFSCSR_P27 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P27		(1 << 27)
/** PIOD_PIO_IFSCSR_P26 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P26		(1 << 26)
/** PIOD_PIO_IFSCSR_P25 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P25		(1 << 25)
/** PIOD_PIO_IFSCSR_P24 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P24		(1 << 24)
/** PIOD_PIO_IFSCSR_P23 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P23		(1 << 23)
/** PIOD_PIO_IFSCSR_P22 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P22		(1 << 22)
/** PIOD_PIO_IFSCSR_P21 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P21		(1 << 21)
/** PIOD_PIO_IFSCSR_P20 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P20		(1 << 20)
/** PIOD_PIO_IFSCSR_P19 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P19		(1 << 19)
/** PIOD_PIO_IFSCSR_P18 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P18		(1 << 18)
/** PIOD_PIO_IFSCSR_P17 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P17		(1 << 17)
/** PIOD_PIO_IFSCSR_P16 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P16		(1 << 16)
/** PIOD_PIO_IFSCSR_P15 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P15		(1 << 15)
/** PIOD_PIO_IFSCSR_P14 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P14		(1 << 14)
/** PIOD_PIO_IFSCSR_P13 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P13		(1 << 13)
/** PIOD_PIO_IFSCSR_P12 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P12		(1 << 12)
/** PIOD_PIO_IFSCSR_P11 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P11		(1 << 11)
/** PIOD_PIO_IFSCSR_P10 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P10		(1 << 10)
/** PIOD_PIO_IFSCSR_P9 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P9		(1 << 9)
/** PIOD_PIO_IFSCSR_P8 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P8		(1 << 8)
/** PIOD_PIO_IFSCSR_P7 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P7		(1 << 7)
/** PIOD_PIO_IFSCSR_P6 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P6		(1 << 6)
/** PIOD_PIO_IFSCSR_P5 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P5		(1 << 5)
/** PIOD_PIO_IFSCSR_P4 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P4		(1 << 4)
/** PIOD_PIO_IFSCSR_P3 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P3		(1 << 3)
/** PIOD_PIO_IFSCSR_P2 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P2		(1 << 2)
/** PIOD_PIO_IFSCSR_P1 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P1		(1 << 1)
/** PIOD_PIO_IFSCSR_P0 Glitch or Debouncing Filter Selection Status **/
#define PIOD_PIO_IFSCSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pio_scdr PIOSCDR Slow Clock Divider Debouncing Register
@{*/


#define PIOD_PIO_SCDR_DIV_SHIFT		0
#define PIOD_PIO_SCDR_DIV_MASK		0x3fff
/** @defgroup piod_pio_scdr_div DIV Slow Clock Divider Selection for Debouncing
@{*/
/**@}*/


/**@}*/

